# ParentId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisplacementElement..::..ParentId Property
DisplacementElement Class See Also
---
The element id of the parent DisplacementElement. This DisplacementElement's relative transform will be concatenated with the absolute transform of its parent.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ElementId ParentId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ParentId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ParentId {
	ElementId^ get ();
}
```

# See Also
DisplacementElement Class
Autodesk.Revit.DB Namespace